###  Part # 1
  #### Terraform Format and Style 🖌`failure`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/d273cdb3-a515-4663-8487-3bffe9ba6ed4/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.ja-alb will be created
  + resource "aws_lb" "ja-alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ja-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0e351f4564c7b01bf",
        ]
      + subnets                                                      = [
          + "subnet-0364de2c94bb2ac98",
          + "subnet-0621ce70c3736f61c",
        ]
      + tags                                                         = {
          + "Environment" = "ja"
        }
      + tags_all                                                     = {
          + "Environment" = "ja"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.jalistener will be created
  + resource "aws_lb_listener" "jalistener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "jawebtg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "http"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-07c1a579f148d56f7"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_lb_target_group_attachment.jaattach1 will be created
  + resource "aws_lb_target_group_attachment" "jaattach1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-0192752098bb6e37b"
    }

  # aws_lb_target_group_attachment.jaattach2 will be created
  + resource "aws_lb_target_group_attachment" "jaattach2" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = "i-05570e8888cee860d"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + loadbalancerdns = "ja-alb"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.ja-alb will be created%0A  + resource "aws_lb" "ja-alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "ja-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-0e351f4564c7b01bf",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-0364de2c94bb2ac98",%0A          + "subnet-0621ce70c3736f61c",%0A        ]%0A      + tags                                                         = {%0A          + "Environment" = "ja"%0A        }%0A      + tags_all                                                     = {%0A          + "Environment" = "ja"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A    }%0A%0A  # aws_lb_listener.jalistener will be created%0A  + resource "aws_lb_listener" "jalistener" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_lb_target_group.tg will be created%0A  + resource "aws_lb_target_group" "tg" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "jawebtg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "http"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-07c1a579f148d56f7"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = 3%0A        }%0A    }%0A%0A  # aws_lb_target_group_attachment.jaattach1 will be created%0A  + resource "aws_lb_target_group_attachment" "jaattach1" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-0192752098bb6e37b"%0A    }%0A%0A  # aws_lb_target_group_attachment.jaattach2 will be created%0A  + resource "aws_lb_target_group_attachment" "jaattach2" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = "i-05570e8888cee860d"%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + loadbalancerdns = "ja-alb"%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*